dev.org
** To do

How to describe any mode? Not necessarily the current mode.

winner-mode

*** TODO Sane redo

** Keyboard macros

C-x (    Start recording
C-x )    Stop recording

C-x e    execute macro (e to repeat)
C-u 10 C-x e  execute macro 10 times

http://www.emacswiki.org/emacs/KeyboardMacros

http://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macros.html#Keyboard-Macros

*** temporary example

Keyboard Macros

Begin recording: C-x (
End recording: C-x )
Execute macro: C-x e
Example: Add 'extern' before all function protoypes in a file.
Go to the first prototype, and say:

    C-x (
    C-a
    extern<SPACE>
    C-n
    C-x )
Then say C-u 50 C-x e to replace 50 prototypes.


** Links
[[http://www.learningclojure.com/2009/12/favourite-keys-for-emacs-and-slime.html][Learning Clojure: Favourite keys for EMACS and SLIME]]

[[http://www.gnu.org/software/emacs/manual/html_node/emacs/Expressions.html][Expressions - GNU Emacs Manual]]

[[http://www.math.uh.edu/~bgb/emacs_keys.html][Emacs key combinations]]


** org
[[file:d:/docs/Misc/emacs/orgcard-7.8.pdf][org-mode reference]]

[[http://orgmode.org/org.html][org manual (online)]]

** little hacks

*** Default folder
When emacs starts, the home folder should be the current folder. Put this in .emacs, 

(cd "~")

*** Export dev notes

Open ~/dev.org
C-c C-e b

This will export to org.html and also open the file in browser. 

C-c C-e h Export only 


*** 

;; save and restore my buffers every time
(desktop-save-mode 1)

;; show me line and column nos
(line-number-mode t)
(column-number-mode t)

;; cscope
(require 'xcscope)
(setq cscope-do-not-update-database t)

;; show date and time in mode-line
(setq display-time-day-and-date t )

(display-time)





** mark ring
There are local and global mark rings.

cua-set-mark 

Default bindings: C-@ and C-SPC

Toggle mark.


Move back in mark ring using all of these command.
C-u C-SPC
C-u C-@

C-x C-SPC
C-x C-@

*** TODO How do we move forward in mark ring once we've gone back?

** registers 
point-to-register

C-x r SPC a           Save current location in register a

C-x r j a             Go back to that location or restore that configuration.

Registers are characters

List of registers   list-registers in register.el



** calculator
M-x calculator


Change input base: i (b | o | h)
Change output base: o (b | o | h)


** [[file:.emacs][.emacs]]

** desktop and other layout

*** TODO How to save / restore desktop?

*** TODO How to save / restore buffers? Open a number of buffers on startup.


* linux

** reload profile

After changing the bash profile, you need to reload it:

$ source ~/.bashrc

$ source ~/.profile


* Clojure

Use project [[file:d:/docs/Clojure/projects/clj][here]] to try out code. 

Click on the link and a dired buffer will open. From there use 

M-x clojure-jack-in

to run swank and connect slime into it.

