dev.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> emacs </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> To do </h3>
<div class="outline-text-3" id="text-2_1">


<p>
How to describe any mode? Not necessarily the current mode.
</p>
<p>
winner-mode
</p>

</div>

<div id="outline-container-2_1_1" class="outline-4">
<h4 id="sec-2_1_1"><span class="section-number-4">2.1.1</span> <span class="todo TODO"> TODO</span> Sane redo </h4>
<div class="outline-text-4" id="text-2_1_1">


</div>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Keyboard macros </h3>
<div class="outline-text-3" id="text-2_2">


<p>
C-x (    Start recording
C-x )    Stop recording
</p>
<p>
C-x e    execute macro (e to repeat)
C-u 10 C-x e  execute macro 10 times
</p>
<p>
<a href="http://www.emacswiki.org/emacs/KeyboardMacros">http://www.emacswiki.org/emacs/KeyboardMacros</a>
</p>
<p>
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macros.html#Keyboard-Macros">http://www.gnu.org/software/emacs/manual/html_node/emacs/Keyboard-Macros.html#Keyboard-Macros</a>
</p>

</div>

<div id="outline-container-2_2_1" class="outline-4">
<h4 id="sec-2_2_1"><span class="section-number-4">2.2.1</span> temporary example </h4>
<div class="outline-text-4" id="text-2_2_1">


<p>
Keyboard Macros
</p>
<p>
Begin recording: C-x (
End recording: C-x )
Execute macro: C-x e
Example: Add 'extern' before all function protoypes in a file.
Go to the first prototype, and say:
</p>
<p>
    C-x (
    C-a
    extern&lt;SPACE&gt;
    C-n
    C-x )
Then say C-u 50 C-x e to replace 50 prototypes.
</p>

</div>
</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Links </h3>
<div class="outline-text-3" id="text-2_3">

<p><a href="http://www.learningclojure.com/2009/12/favourite-keys-for-emacs-and-slime.html">Learning Clojure: Favourite keys for EMACS and SLIME</a>
</p>
<p>
<a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Expressions.html">Expressions - GNU Emacs Manual</a>
</p>
<p>
<a href="http://www.math.uh.edu/~bgb/emacs_keys.html">Emacs key combinations</a>
</p>

</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> org </h3>
<div class="outline-text-3" id="text-2_4">

<p><a href="file://d:/docs/Misc/emacs/orgcard-7.8.pdf">org-mode reference</a>
</p>
<p>
<a href="http://orgmode.org/org.html">org manual (online)</a>
</p>
</div>

</div>

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> little hacks </h3>
<div class="outline-text-3" id="text-2_5">



</div>

<div id="outline-container-2_5_1" class="outline-4">
<h4 id="sec-2_5_1"><span class="section-number-4">2.5.1</span> Default folder </h4>
<div class="outline-text-4" id="text-2_5_1">

<p>When emacs starts, the home folder should be the current folder. Put this in .emacs, 
</p>
<p>
(cd "~")
</p>
</div>

</div>

<div id="outline-container-2_5_2" class="outline-4">
<h4 id="sec-2_5_2"><span class="section-number-4">2.5.2</span> Export dev notes </h4>
<div class="outline-text-4" id="text-2_5_2">


<p>
Open ~/dev.org
C-c C-e b
</p>
<p>
This will export to org.html and also open the file in browser. 
</p>
<p>
C-c C-e h Export only 
</p>

</div>

</div>

<div id="outline-container-2_5_3" class="outline-4">
<h4 id="sec-2_5_3"><span class="section-number-4">2.5.3</span> </h4>
<div class="outline-text-4" id="text-2_5_3">


<p>
;; save and restore my buffers every time
(desktop-save-mode 1)
</p>
<p>
;; show me line and column nos
(line-number-mode t)
(column-number-mode t)
</p>
<p>
;; cscope
(require 'xcscope)
(setq cscope-do-not-update-database t)
</p>
<p>
;; show date and time in mode-line
(setq display-time-day-and-date t )
</p>
<p>
(display-time)
</p>




</div>
</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3">2.6</span> mark ring </h3>
<div class="outline-text-3" id="text-2_6">

<p>There are local and global mark rings.
</p>
<p>
cua-set-mark 
</p>
<p>
Default bindings: C-@ and C-SPC
</p>
<p>
Toggle mark.
</p>

<p>
Move back in mark ring using all of these command.
C-u C-SPC
C-u C-@
</p>
<p>
C-x C-SPC
C-x C-@
</p>

</div>

<div id="outline-container-2_6_1" class="outline-4">
<h4 id="sec-2_6_1"><span class="section-number-4">2.6.1</span> <span class="todo TODO"> TODO</span> How do we move forward in mark ring once we've gone back? </h4>
<div class="outline-text-4" id="text-2_6_1">


</div>
</div>

</div>

<div id="outline-container-2_7" class="outline-3">
<h3 id="sec-2_7"><span class="section-number-3">2.7</span> registers </h3>
<div class="outline-text-3" id="text-2_7">

<p>point-to-register
</p>
<p>
C-x r SPC a           Save current location in register a
</p>
<p>
C-x r j a             Go back to that location or restore that configuration.
</p>
<p>
Registers are characters
</p>
<p>
List of registers   list-registers in register.el
</p>


</div>

</div>

<div id="outline-container-2_8" class="outline-3">
<h3 id="sec-2_8"><span class="section-number-3">2.8</span> calculator </h3>
<div class="outline-text-3" id="text-2_8">

<p>M-x calculator
</p>

<p>
Change input base: i (b | o | h)
Change output base: o (b | o | h)
</p>

</div>

</div>

<div id="outline-container-2_9" class="outline-3">
<h3 id="sec-2_9"><span class="section-number-3">2.9</span> <a href=".emacs">.emacs</a> </h3>
<div class="outline-text-3" id="text-2_9">


</div>

</div>

<div id="outline-container-2_10" class="outline-3">
<h3 id="sec-2_10"><span class="section-number-3">2.10</span> desktop and other layout </h3>
<div class="outline-text-3" id="text-2_10">



</div>

<div id="outline-container-2_10_1" class="outline-4">
<h4 id="sec-2_10_1"><span class="section-number-4">2.10.1</span> <span class="todo TODO"> TODO</span> How to save / restore desktop? </h4>
<div class="outline-text-4" id="text-2_10_1">


</div>

</div>

<div id="outline-container-2_10_2" class="outline-4">
<h4 id="sec-2_10_2"><span class="section-number-4">2.10.2</span> <span class="todo TODO"> TODO</span> How to save / restore buffers? Open a number of buffers on startup. </h4>
<div class="outline-text-4" id="text-2_10_2">



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> linux </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> reload profile </h3>
<div class="outline-text-3" id="text-3_1">


<p>
After changing the bash profile, you need to reload it:
</p>
<p>
$ source ~/.bashrc
</p>
<p>
$ source ~/.profile
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Clojure </h2>
<div class="outline-text-2" id="text-4">


<p>
Use project <a href="file://d:/docs/Clojure/projects/clj">here</a> to try out code. 
</p>
<p>
Click on the link and a dired buffer will open. From there use 
</p>
<p>
M-x clojure-jack-in
</p>
<p>
to run swank and connect slime into it.
</p>

</div>
