dev.html

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> destructuring </h3>
<div class="outline-text-3" id="text-4_1">


<p>
<a href="http://blog.jayfields.com/2010/07/clojure-destructuring.html">Clojure: Destructuring by Jay Fields</a>
</p>
<p>
Assign the values of a vector:
</p>
<p>
user=&gt; (def point [5 7])
</p>
<p>
user=&gt; (let [[x y] point]
         (println "x:" x "y:" y))
x: 5 y: 7
</p>
<p>
Split a vector into a head and a tail:
</p>
<p>
user=&gt; (def indexes [1 2 3])
</p>
<p>
user=> (let [[x &amp; more] indexes]
         (println "x:" x "more:" more))
x: 1 more: (2 3)
</p>
<p>
Note the use of arglist**. It can be used in function parameters and in destructuring.
</p>
<p>
Bind the entire vector to a local using :as
</p>
<p>
user=&gt; (def indexes [1 2 3])
</p>
<p>
user=> (let [[x &amp; more :as full-list] indexes]
         (println "x:" x "more:" more "full list:" full-list))
x: 1 more: (2 3) full list: [1 2 3]
</p>

<p>
Destructuring a map
</p>
<p>
user=&gt; (def point {:x 5 :y 7})
</p>
<p>
user=&gt; (let [{x :x y :y} point]
         (println "x:" x "y:" y))
x: 5 y: 7
</p>
<p>
The use of :keys directive while destruturing a map
</p>
<p>
As the above illustrates, we often need to have local variables to be named as the keys of the map
we are destructuring. To avoid doing it manually, :keys directive is provided:
</p>
<p>
user=&gt; (def point {:x 5 :y 7})
</p>
<p>
user=&gt; (let [{:keys [x y]} point]
         (println "x:" x "y:" y))
x: 5 y: 7
</p>
<p>
It is also possible to use both :keys and :as directives:
</p>
<p>
user=&gt; (def point {:x 5 :y 7})
</p>
<p>
user=&gt; (let [{:keys [x y] :as the-point} point]
         (println "x:" x "y:" y "point:" the-point))
x: 5 y: 7 point: {:x 5, :y 7}
</p>
<p>
The :or directive
Assign a default value to a key when the map does not contain a specified key:
</p>
<p>
user=&gt; (def point {:y 7})
</p>
<p> 
user=&gt; (let [{:keys [x y] :or {x 0 y 0}} point]
         (println "x:" x "y:" y))
x: 0 y: 7
</p>
<p>
Lastly, it's also worth noting that you can destructure nested maps, vectors and a combination of both.
</p>
<p>
The following example destructures a nested map
</p>
<p>
user=&gt; (def book {:name "SICP" :details {:pages 657 :isbn-10 "0262011530"}})
</p>
<p>
user=&gt; (let [{name :name {pages :pages isbn-10 :isbn-10} :details} book]
         (println "name:" name "pages:" pages "isbn-10:" isbn-10))
name: SICP pages: 657 isbn-10: 0262011530
</p>

<p>
As you would expect, you can also use directives while destructuring nested maps.
</p>
<p>
user=&gt; (def book {:name "SICP" :details {:pages 657 :isbn-10 "0262011530"}})
user=&gt; 
user=&gt; (let [{name :name {:keys [pages isbn-10]} :details} book]
         (println "name:" name "pages:" pages "isbn-10:" isbn-10))
name: SICP pages: 657 isbn-10: 0262011530
</p>
<p>
Destructuring nested vectors is also very straight-forward, as the following example illustrates
</p>
<p>
user=&gt; (def numbers <a href="#1--2">3 4</a>)
</p>
<p>
user=&gt; (let <a href="#a--b">c d</a> numbers]
  (println "a:" a "b:" b "c:" c "d:" d))
a: 1 b: 2 c: 3 d: 4
</p>
<p>
The following example destructures a map and a vector at the same time.
user=&gt; (def golfer {:name "Jim" :scores [3 5 4 5]})
</p>
<p>
user=&gt; (let [{name :name [hole1 hole2] :scores} golfer] 
         (println "name:" name "hole1:" hole1 "hole2:" hole2))
name: Jim hole1: 3 hole2: 5
The same example can be rewritten using a function definition to show the simplicity of using destructuring in parameter lists.
user=&gt; (defn print-status [{name :name [hole1 hole2] :scores}] 
  (println "name:" name "hole1:" hole1 "hole2:" hole2))
</p>
<p>
user=&gt; (print-status {:name "Jim" :scores [3 5 4 5]})
name: Jim hole1: 3 hole2: 5
There are other (less used) directives and deeper explanations available on <a href="http://clojure.org/special_forms">http://clojure.org/special_forms</a> and in The Joy of Clojure. I recommend both.
</p>
<p>
**(defn do-something [x y &amp; more] &hellip; )
</p>
<p>
Comment by Fogus:
</p>
<p>
Nice post. One other note that naturally follows from the end of your post is that destructuring forms the basis of Clojure's named arguments:
</p>
<p>
(defn print-status [&amp; {name :name [hole1 hole2] :scores}] 
(println "name:" name "hole1:" hole1 "hole2:" hole2))
</p>
<p>
(print-status :name "Joey" :scores [42 18])
</p>

<p>
You can also use pre-conditions to check if certain arguments are passed in:
</p>

<p>
(defn print-status [&amp; {name :name [hole1 hole2] :scores}]
{:pre [name]}
(println "name:" name "hole1:" hole1 "hole2:" hole2))
</p>
<p>
(print-status :scores [42 18])
; java.lang.AssertionError: Assert failed: name
</p>
<p>
(print-status :name "Joey" :scores [42 18])
; name: Joey hole1: 42 hole2: 18
</p>

</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> ClojureScript One </h3>
<div class="outline-text-3" id="text-4_2">


</div>

<div id="outline-container-4_2_1" class="outline-4">
<h4 id="sec-4_2_1"><span class="section-number-4">4.2.1</span> <a href="file://c:/Users/cssosns/dev-notes/documentation.html">Marginalia</a> </h4>
<div class="outline-text-4" id="text-4_2_1">


</div>

</div>

<div id="outline-container-4_2_2" class="outline-4">
<h4 id="sec-4_2_2"><span class="section-number-4">4.2.2</span> <a href="One1.pdf">ClojureScript One wiki as pdf</a> </h4>
<div class="outline-text-4" id="text-4_2_2">


<p>
Arrived at the pdf from a strange route. Copy/pasted all wiki pages into OneNote. Adjusted some
links. Then printed pdf from OneNote. Crazy! There must be a direct way to export pdf from github
wiki.
</p>
<ul>
<li id="sec-4_2_2_1"><span class="todo TODO"> TODO</span> Export github wiki to pdf <br/>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4_3" class="outline-3">
<h3 id="sec-4_3"><span class="section-number-3">4.3</span> Clojure cheat sheets </h3>
<div class="outline-text-3" id="text-4_3">

<p><a href="https://github.com/fogus/clojure-cheatsheets">https://github.com/fogus/clojure-cheatsheets</a>
</p>
<p>
<a href="cheatsheet-a4-color.pdf">Clojure Cheatseet</a>
</p>
<p>
<a href="cljs-cheatsheet.pdf">ClojureScript Cheatsheet</a>
</p>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> git </h2>
<div class="outline-text-2" id="text-5">


<p>
<a href="git_cheat_sheet.pdf">git cheat sheet by roger dudler</a>
</p>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> JavaScript </h2>
<div class="outline-text-2" id="text-6">


<p>
<a href="https://developer.mozilla.org/en/JavaScript/A_re-introduction_to_JavaScript">https://developer.mozilla.org/en/JavaScript/A_re-introduction_to_JavaScript</a>
</p>
<p>
<a href="http://ejohn.org/apps/learn/">http://ejohn.org/apps/learn/</a>
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Misc </h2>
<div class="outline-text-2" id="text-7">



</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> <span class="todo TODO"> TODO</span> export git hub wiki into pdf </h3>
<div class="outline-text-3" id="text-7_1">


<p>
I want to read <a href="https://github.com/brentonashworth/one/wiki">one</a> wiki offline. What is the best way to do that?
</p>
</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> calculate date difference using Joda time </h3>
<div class="outline-text-3" id="text-7_2">

<p>This is just insanely intuitive!
</p>

<p>
Date expiryDate = new Date(2008, 10, 10);
Date currentDate = new Date(2012, 03, 14);
int days = Days.daysBetween(new DateTime(expiryDate), new DateTime(currentDate)).getDays(); 
int years = Years.yearsBetween(new DateTime(expiryDate), new DateTime(currentDate)).getYears();
System.out.printf("Years: %d, days: %d\n", years, days);
</p>
<p>
=&gt;   Years: 3, days: 1251
</p>

<p>
Period period = new Period(new DateTime(expiryDate), new DateTime(currentDate));
</p>
<p>
System.out.printf("Period: %s; years: %d, months: %d days: %d\n", period, period.getYears(), period.getMonths(), period.getDays());
</p>
<p>
=&gt; Period: P3Y5M4D; years: 3, months: 5 days: 4
</p>
<p>
Period periodYearDay = new Period(new DateTime(expiryDate), new DateTime(currentDate), PeriodType.yearDay());
</p>
<p>
System.out.printf("Period: %s; years: %d days: %d\n", periodYearDay, periodYearDay.getYears(), periodYearDay.getDays());
</p>
<p>
=&gt; Period: P3Y156D; years: 3 days: 156
</p>
<p>
<a href="http://joda-time.sourceforge.net/faq.html">http://joda-time.sourceforge.net/faq.html</a>
</p>
</div>
</div>
</div>
<div id="postamble">
<p class="author">Author: </p>
<p class="creator">Org version 7.5 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
